Article: Efficient estimation in the Fine and Gray model

Authors:  Thomas H. Scheike, Torben Martinussen, Brice Ozenne

* Content of the folder

* Run R code

-  [[./run-simulations.R]] run the simulation studies presented in section
  7 "Simulations".
-  [[./figure1.R]] contains the code used to generate figure 1 from the
  simulation results.
-  [[./table1.R]] contains the code used to performed the statistical
  analysis of section 8 "Illustration", and to generate table 1. Since
  we were not not allowed to freely share the dataset, the file can be
  run using simulated data (i.e. not reproducing exactly the actual
  table 1 of the article).

* R and package versions
#+BEGIN_SRC R :exports none :results output :session *R* :cache no
library(mets)
library(data.table)
library(ggplot2)
library(doMC) ## install.packages("doMC", repos="http://R-Forge.R-project.org")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R  :results output   :exports results  :session *R* :cache no
sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
R version 4.1.1 (2021-08-10)
Platform: x86_64-w64-mingw32/x64 (64-bit)
Running under: Windows 10 x64 (build 19044)

Matrix products: default

locale:
[1] LC_COLLATE=Danish_Denmark.1252  LC_CTYPE=Danish_Denmark.1252   
[3] LC_MONETARY=Danish_Denmark.1252 LC_NUMERIC=C                   
[5] LC_TIME=Danish_Denmark.1252    

attached base packages:
[1] parallel  stats     graphics  grDevices utils     datasets  methods  
[8] base     

other attached packages:
[1] doMC_1.3.5        iterators_1.0.13  foreach_1.5.1     ggplot2_3.3.5    
[5] data.table_1.14.2 mets_1.2.9        lava_1.6.10       timereg_2.0.1    
[9] survival_3.2-13  

loaded via a namespace (and not attached):
 [1] Rcpp_1.0.7          compiler_4.1.1      pillar_1.6.4       
 [4] tools_4.1.1         digest_0.6.29       lifecycle_1.0.1    
 [7] tibble_3.1.6        gtable_0.3.0        lattice_0.20-45    
[10] pkgconfig_2.0.3     rlang_0.4.12        Matrix_1.4-0       
[13] DBI_1.1.2           mvtnorm_1.1-3       withr_2.4.3        
[16] dplyr_1.0.7         generics_0.1.1      vctrs_0.3.8        
[19] globals_0.14.0      tidyselect_1.1.1    grid_4.1.1         
[22] glue_1.6.0          listenv_0.8.0       R6_2.5.1           
[25] future.apply_1.8.1  fansi_0.5.0         parallelly_1.30.0  
[28] purrr_0.3.4         magrittr_2.0.1      scales_1.1.1       
[31] codetools_0.2-18    ellipsis_0.3.2      splines_4.1.1      
[34] assertthat_0.2.1    future_1.23.0       colorspace_2.0-2   
[37] numDeriv_2016.8-1.1 utf8_1.2.2          munsell_0.5.0      
[40] crayon_1.4.2
#+end_example

